const monthDefault = [
  'Январь',
  'Февраль',
  'Март',
  'Апрель',
  'Май',
  'Июнь',
  'Июль',
  'Август',
  'Сентябрь',
  'Октябрь',
  'Ноябрь',
  'Декабрь',
];

const monthsGenitive = [
  'Января',
  'Февраля',
  'Марта',
  'Апреля',
  'Мая',
  'Июня',
  'Июля',
  'Августа',
  'Сентября',
  'Октября',
  'Ноября',
  'Декабря',
];

const START_YEAR = 2003;

const availableDates = [
  [new Date('1/1/2003'), new Date('8/31/2022')],
  [new Date('10/1/2022'), new Date('12/31/2022')]
]

let now = new Date('2023-03-10');

console.log(now);